CSI API ETABS v1
cDesignSteel.SetTargetPeriod Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTargetPeriod(
	int NumberItems,
	string ModalCase,
	ref int[] Mode,
	ref double[] Period,
	bool Active = true
)
Function SetTargetPeriod (
	NumberItems As Integer,
	ModalCase As String,
	ByRef Mode As Integer(),
	ByRef Period As Double(),
	Optional Active As Boolean = true
) As Integer
Dim instance As cDesignSteel
Dim NumberItems As Integer
Dim ModalCase As String
Dim Mode As Integer()
Dim Period As Double()
Dim Active As Boolean
Dim returnValue As Integer
returnValue = instance.SetTargetPeriod(NumberItems,
	ModalCase, Mode, Period, Active)
int SetTargetPeriod(
	int NumberItems,
	String^ ModalCase,
	array<int>^% Mode,
	array<double>^% Period,
	bool Active = true
)
abstract SetTargetPeriod :
        NumberItems : int *
        ModalCase : string *
        Mode : int[] byref *
        Period : float[] byref *
        ?Active : bool
(* Defaults:
        let _Active = defaultArg Active true
*)
-> int
Parameters
NumberItems
Type: System.Int32
ModalCase
Type: System.String
Mode
Type: System.Int32[]
Period
Type: System.Double[]
Active (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace